Tutorial/electrorefining/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.001;

e 1;
h 20;
z 100;
z1 115;

ny 60;
nz 180;
nz1 25;

gy          ( 
	      (0.01 0.15 10)    // 10% y-dir, 15% cells, expansion = 10 
              (0.49 0.35 11)
	      (0.49 0.35 0.090909)
              (0.01 0.15 0.1) // 10% y-dir, 15% cells, expansion = 0.1 
            ) ;


vertices
(

(0 0 0)
($e 0 0)
($e $h 0)
(0 $h 0)

(0 0 $z)
($e 0 $z)
($e $h $z)
(0 $h $z)

);

blocks
(
	hex	(0 1 2 3 4 5 6 7)	(1 $ny $nz) simpleGrading (1 $gy 1)
);

edges
(

);

boundary
(
    wall_inlet
    {
        type wall;
        faces
        (
		(0 1 2 3)	
        );
    }

    wall_outlet
    {
        type wall;
        faces
        (
		(4 5 6 7)
        );
    }


    wall_cathode
    {
        type wall;
        faces
        (
		(0 1 5 4)		
        );
    }
 
    wall_anode
    {
        type wall;
        faces
        (	
		(2 3 7 6)
        );
    }
					
    frontAndBack
    {
        type empty;
        faces
        (
		(1 5 6 2)		
		(0 3 7 4)					
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
