Tutorial/electrorefining/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    
    //grad(gammaInt)  cellLimited Gauss linear 1;//Gauss linear;//1.0;
    //grad(ReThetat)  cellLimited Gauss linear 1;//Gauss linear;//1.0;//*/
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss upwind;//bounded 
    div(phi,T)      Gauss upwind;
    div(phi,rho_i)  Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(R)          Gauss upwind;//linear;
    
    div(phi,nuTilda) Gauss upwind;//Gauss limitedLinear 1;
    
    div(phi,gammaInt)   Gauss upwind;// bounded Gauss linearUpwind grad;//
    div(phi,ReThetat)   Gauss upwind;//bounded Gauss linearUpwind grad;//
    
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;//
    //laplacian(keff,fi) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;//
}

wallDist
{
    method          meshWave;
    //nRequired       yes;
}

// ************************************************************************* //
