Tutorial/electrorefining/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|T|rho_i|k|epsilon|omega|ReThetat|gammaInt|nuTilda|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }
    
    /*gammaInt
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
        maxIter         10;
    }
    
    ReThetat
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
        maxIter         10;
    }*/
      
    fi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.3;//0.5;
    }
    
    fiFinal
    {
        $fi;
        relTol          0;
    }


    "(U|T|rho_i|k|epsilon|omega|ReThetat|gammaInt|nuTilda|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;//yes;//
    //consistent      yes; //SIMPLEC
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        "(U|T|rho_i|k|epsilon|omega|R)" 1;
        "(U|T|rho_i|k|epsilon|omega|R)Final" 1;
    }
}

// ************************************************************************* //
